app/views/baskets/_show.html.erb

    <tbody>
        <% @basket.products.each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "baskets_products" ON "products"."id" = "baskets_products"."product_id" WHERE "baskets_products"."basket_id" = $1