app/views/baskets/basket_details.html.erb

SELECT "products".* FROM "products" INNER JOIN "baskets_products" ON "products"."id" = "baskets_products"."product_id" WHERE "baskets_products"."basket_id" = $1
---
    <tbody>
        <% @basket.products.each do |product| %>