app/controllers/baskets_controller.rb

  def cancel_product
    @basket.products.destroy(Product.find(params[:product_id]))
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1