app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1
---
  def set_product
    if !params[:id].nil?
      @product = Product.find(params[:id])