app/models/basket.rb

  def total_price
    products = Product.in_basket(self)
    total_price = 0
    products.each do |product|
      product_in_basket = BasketsProduct.find_by(basket_id: self.id, product_id: product.id)
      total_price += product_in_basket.quantity * Product.find(product_in_basket.product_id).price
---
SELECT  "baskets_products".* FROM "baskets_products" WHERE "baskets_products"."basket_id" = $1 AND "baskets_products"."product_id" = $2 LIMIT 1
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1

  def products_quantities
    products_in_baskets = BasketsProduct.where(basket_id: self.id)
    quantities = Hash.new

    products_in_baskets.each do |product|
---
SELECT "baskets_products".* FROM "baskets_products" WHERE "baskets_products"."basket_id" = $1

  def put(product_id, quantity)
    basket_product = BasketsProduct.find_by(product_id: product_id, basket_id: self.id)

    if(basket_product.nil?)
      self.products.push(Product.find(product_id))
      self.save
      basket_product = BasketsProduct.find_by(product_id: product_id, basket_id: self.id)
      basket_product.quantity  = quantity
      basket_product.save
---
SELECT  "baskets_products".* FROM "baskets_products" WHERE "baskets_products"."product_id" = $1 AND "baskets_products"."basket_id" = $2 LIMIT 1
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1
UPDATE "baskets_products" SET "quantity" = $1 WHERE "baskets_products"."id" = $2