app/views/products/list.html.erb

<table style="border-radius: 1px;border-color: black" class="table">
    <caption>List of products <span class="badge"><%= Product.count %></span> </caption>
---
SELECT COUNT(*) FROM "products"

                <td>
                  <% product.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = $1

            <tbody>
                <% @basket.products.each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "baskets_products" ON "products"."id" = "baskets_products"."product_id" WHERE "baskets_products"."basket_id" = $1