app/views/layouts/_header_layout.html.erb

SELECT COUNT(*) FROM "products" INNER JOIN "categories_products" ON "products"."id" = "categories_products"."product_id" WHERE "categories_products"."category_id" = $1
---
                    <li><%= link_to action: 'show', controller: '/categories', id: category.id do%>
                    <%= category.name %><span class="badge"><%= category.products.size %></span>